{
  "education": [
    {
      "institution_name": "Viet Nam National University - HCMC",
      "degree": "IT Software",
      "major": "N/A",
      "gpa": "N/A",
      "start_time": "Oct, 2005",
      "end_time": "2010"
    },
    {
      "institution_name": "Lotus College",
      "degree": "Graphic Art Design",
      "major": "N/A",
      "gpa": "N/A",
      "start_time": "Sep, 2005",
      "end_time": "Feb, 2006"
    },
    {
      "institution_name": "University of Economics HCMC",
      "degree": "Business Administration",
      "major": "N/A",
      "gpa": "N/A",
      "start_time": "Jul, 2010",
      "end_time": "Feb, 2011"
    },
    {
      "institution_name": "Dong Nai Labour and Social Welfare Service",
      "degree": "Soft skills in management",
      "major": "N/A",
      "gpa": "N/A",
      "start_time": "2010",
      "end_time": "N/A"
    },
    {
      "institution_name": "Institute of Human Resource Development - University of Economics HCMC",
      "degree": "HR Management & CPO",
      "major": "N/A",
      "gpa": "N/A",
      "start_time": "Oct, 2011",
      "end_time": "N/A"
    }
  ],
  "work_experience": [
    {
      "company_name": "Enercon Vietnam Co., Ltd",
      "position": "HR Specialist",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Building a performing HR organization in a growing company at multiple locations",
        "Acting as a contact person, advisor and mentor to executives and employees",
        "Implementing and developing structures, processes and instruments",
        "Performing as an interface between the headquarters and the Local Organization in order to maintain corporate HR guidelines and polices.",
        "Cooperate with third party Payroll Company to process the monthly payroll calculation, including personal income tax. Coordination and cooperation with external consultant and authorities",
        "Preparation and revising of internal polices an processes in cooperation with HR Headquarter",
        "Employee relationship management, e.g. introducing of employees to policies, personnel individual actions, supporting of the employees in solving personal and/or work related issues",
        "Develop strategies to drive improvement in hire practices",
        "Recruiting new employees at all level",
        "Prepare contracts for new employees, update contracts and ensure amendments.",
        "Preparation and communication reports to the respective interfaces, mainly but not limited to Labor Report and Expert Reports",
        "Take care of the social security for employees.",
        "Personal information filing and management, including personal data, labor contract, work permit",
        "Being the contact person for external consultant, internal departments regarding Vietnam HR issues",
        "Attendance/ time management",
        "Supporting for international recruiting"
      ],
      "start_time": "Jan 2021",
      "end_time": "Present"
    },
    {
      "company_name": "ON Semiconductor Vietnam Co., Ltd",
      "position": "ER Section Head",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Strengthen employees’ understanding and living company's core values",
        "Enhance communications to all staff for awareness",
        "Initiate activities to improve their understanding and turn it into action of life",
        "Leverage Recognition & Respect Culture",
        "Follow the approved Recognition criteria and scheme to communicate to Departments and make tracking for budget controlling",
        "Celebrate to honor recognized loyalty and dedication employees",
        "Promote staff well-being and maintain good working environment",
        "Analyse staffs’ insight/expectation, plan, generate idea/concept and follow up organizing/execution all HR activities/events as per approved plans and budgets (Outing, Year End Party, clubs, Team Building activities …)",
        "Initiate to attract the high involvement of staff in every activities/events and improve their contentment accordingly",
        "Launch out survey to measure the project’s success and findings acquiring for next projects improvement",
        "Support HR ad-hoc as assigned by",
        "N/A"
      ],
      "start_time": "Jul 2019",
      "end_time": "2020"
    },
    {
      "company_name": "INTERFLOUR Vietnam Limited",
      "position": "HR Supervisor",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Human Resource management",
        "Involve in set up, maintain & implement the HR system including policies",
        "Involve in set up KPI for staff, and give the advice, counselling to functions department",
        "Employee Relations",
        "Organize the annual satisfaction survey to all employees; get feedback from pioneer team and individuals at site on the working environment direct up-line..",
        "Organize company events related to employees such as: annual company trips, annual parties, trade union activities etc…",
        "“Motivation talk” to employees about their current job (salary, assignments, supervisor…) & review it, summarize and send to HRM weekly.",
        "Report soonest on serious problem to HR manager and get advice.",
        "Instruct and analyse attendance issues for timely action.",
        "Take the role as relationship with local authorities",
        "Take a leader on company Corporate Social Responsibilities (CSR)",
        "Monitoring the implementation of company policies/regulations and handle disciplines",
        "Coordinate with the security team for checking the violation and feedback / report, contact with section heads and pioneer employees for obtaining feedback and explanation.",
        "Contact with the violated employee for preceding the disciplinary measure. Report to HR manager and relevant managers for handling the matter",
        "Coordinate with HR manager all the actual incidents.",
        "N/A"
      ],
      "start_time": "Jan 2016",
      "end_time": "Jul 2019"
    },
    {
      "company_name": "AMWAY Viet Nam Company Limited",
      "position": "HR Specialist",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Recruitment:",
        "Ensure recruitment process is efficient, effective and equitable for supervisory level and below",
        "Prepare internal and external job advertisements, web postings, job descriptions and other materials in accordance with the organization's recruitment standards and business needs so that potential job applicants have the information they need to decide whether, and how to apply for a vacant position",
        "Contact candidates, arrange interview times and develop appropriate interview questions in collaboration with the hiring functions so that interviews are conducted",
        "Interview, test, rank, check references, select candidates and provide feedback to unsuccessful candidates based on the job's selection criteria policies; Prepare job offer letter",
        "Conduct employee orientation/induction and introduction training to ensure new hires quickly integrated into the organization",
        "C&B:",
        "Execute monthly payroll operations accurately & timely, following established standards and policies",
        "Conduct payroll calculating, benefits entitling, taxes registration and contribution, payroll deductions; calculating overtime, shift payments and payroll records maintaining is processed accurately and on time",
        "Ensure payroll reporting and payments are compliant with company policy, generally accepted accounting principles, and relevant government regulations",
        "Maintain employee records in a human resources information system (HRIS) so that information is accurate and secure. Data managed may include personal information; job history; leave accrual records; and details transfers, and salary progression",
        "Check, process and keep in file staff’s documents in accordance with established guidelines so that HR related matters are administered quickly and accurately",
        "Maintain and update company's policies",
        "Support Amway's response to auditing and regulatory inquiries",
        "Manage to ensure all related social insurance accuracy & timely manner",
        "Ensure Social Insurance contribution is reconciled correctly in comparing with payroll",
        "Ensure related changes: increase, decrease to be updated on time and accuracy",
        "Employee Relations",
        "Play as a team member to interact staffs among different functions for better collaboration by team building, safety contest, outing trip, sport events, Year-end party, CSR - charity. Team/Individual “Living our values” Contests",
        "N/A"
      ],
      "start_time": "Nov 2013",
      "end_time": "Dec 2015"
    },
    {
      "company_name": "INTERFLOUR Viet Nam Limited",
      "position": "HR Assistant",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Responsible for recruitment process at Mill; fulfilling employees at non-manager levels recruiting requirement of the Mill",
        "Get the filled Employment Requisition from relevant department heads & report to HR manager",
        "Recommend effective job posting methods and proceed the approved posting decision",
        "Collect the candidate’s applications; proceeding interview & selection",
        "Update Mill Recruitment Status to HR Manager weekly",
        "Assist on new staff orientation training and work reporting procedures",
        "Hand over all completed documents and information related to the successful candidate to Junior HR Coordinator for work reporting preparations",
        "Coordinate with Mill doctor for initial health check to new employees",
        "Conduct Orientation Training briefly to new employees",
        "Ensure all new employees to sign in the respective forms i.e. confidential, labor safety & work regulation undertaking at their first working day.",
        "Ensure Mill tour and introduction of new employees to department heads",
        "Transfer new employees to requesting departments; follow up the work assignment and job introduction as a part of departmental orientation training",
        "Employee Relation Activities",
        "Organize the annual satisfaction survey to all employees at Mill, get feedback from pioneer team and individuals at site on the working environment",
        "Coordinate to organize company events related to employees such as: annual company trips, annual parties, trade union activities etc…",
        "Listening employee’s idea, complaint, query… about their current job (salary, assignments, supervisor…) and review it, summarize and send to HRM weekly",
        "Depend on the problem, maybe discuss with Head of Department to resolve their staffs’ issues",
        "Report soonest on serious problem to HR manager and get her advice",
        "Interview the resignation staff about their leaving; make the exit procedure for them at Mill",
        "Instruct and analyse attendance issues at Mill for timely action",
        "Find out the matter needed to make related memos initially",
        "Conduct motivation talk weekly and have the plan to make it effective. Collecting feedback from the staff on the environment working and get the resolve action properly",
        "N/A"
      ],
      "start_time": "May 2012",
      "end_time": "Oct 2013"
    },
    {
      "company_name": "LLG VINA Limited Liability Company",
      "position": "HR Assistant Manager",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Manage 4 staff in team with different jobs assigned in recruitment, C&B, Administration and expatriate",
        "Recruitment: receiving recruiting request from all departments, post up announcement, advertisement on newspaper or website, collect and filter CV of candidates, make schedule to interview, announce to candidates the result of the interview",
        "Advise to BOD the recruiting and staff developing strategy based on developed requirements of enterprise and labor tendency",
        "Timekeeping: check daily in/out time, check all application form for leaving, report to Department Manager the quantity of employees",
        "Calculate salary: make salary approval for probationary employees, calculate salary end of month, PIT, make pay roll, and pay slip to employees",
        "Compile company regulations based on Labor Law, set up salary scale and regulation to calculate salary, compile processes",
        "Social insurance: make report to Social Insurance, check report and solve the problems related insurance regulations",
        "Labor contract: follow the probationary period and make contracts to employees, announce to employees the end of the contract, make labor contract for Korean staff",
        "Coordinate and comply with the local labor and government authorities",
        "Market survey to stay updated with the latest HR trends and policies",
        "Build recruitment process, salary systems, controlling regulations, company regulations base on Labor Law, Government decrees, and company's policy",
        "Build a strict discipline and accordance with the Labor Law",
        "Build position standard system and job description",
        "Employee relation activities",
        "Implemented policies for staff leave: the sleep mode, leave allowances, pay insurance, etc.",
        "Implemented all process to get work permit for Korean Staff",
        "Manage documents: manage all documents of Korean and Vietnamese employees, income/outgoing documents from Government organizations",
        "Make report for General Manager: all report about recruitment, quantity of employees in company, the situation of labor market every month.",
        "N/A"
      ],
      "start_time": "Feb 2011",
      "end_time": "May 2012"
    },
    {
      "company_name": "SANYO DI SOLUTIONS VIET NAM Cooperation Company",
      "position": "HR Supervisor",
      "working_industry": "N/A",
      "detailed_working_description": [
        "Make plan for recruiting staffs and operators for all departments: receiving recruiting request from all departments and make plan to recruit, post up announcement, advertisement on newspaper or website, collect CV of candidates, make schedule to interview, announce to candidates the result of the interview",
        "Conduct orientation to new comers about company's regulation, Labor law and Social Insurance",
        "Deal with violators in company and make decision based on Company’s regulation",
        "Make report for General Manager: all report about recruitment, quantity of employees in company, the situation of labor market every month.",
        "Control Human Resource software: update data, input new data of employees, update enter time every day, check the shift, overtime and annual leave, calculate salary.",
        "N/A"
      ],
      "start_time": "Feb 2007",
      "end_time": "Feb 2011"
    }
  ],
  "skills": [
    "optimistic",
    "team work",
    "problem solving",
    "time management"
  ],
  "awards": [
    "N/A"
  ],
  "projects": [
    {
      "project_name": "N/A",
      "start_time": "N/A",
      "end_time": "N/A",
      "detailed_descriptions": [
        "N/A"
      ]
    }
  ],
  "job_title": [
    "HR Specialist"
  ],
  "levels": [
    "Senior"
  ],
  "certificates": {
    "language_certificates": [
      {
        "certificate_language": "English",
        "certificate_name": "TOEIC",
        "certificate_point_level": "N/A"
      }
    ],
    "other_certificates": [
      {
        "certificate_name": "N/A",
        "certificate_point_level": "N/A"
      }
    ]
  },
  "industry": [
    "N/A"
  ],
  "objectives": [
    "N/A"
  ],
  "personal_information": {
    "name": "DUONG NHUT UYEN",
    "current_job_position": "HR Specialist",
    "gender": "Female",
    "linkedin": "N/A",
    "website": "N/A",
    "facebook": "N/A",
    "instagram": "N/A",
    "earliest_university_year": "2005",
    "birthday": "March 23, 1983"
  },
  "contact_information": {
    "phone": "093-855-7728",
    "email": "duongnhutuyen@gmail.com",
    "country": "N/A",
    "city/province": "Bien Hoa City",
    "address": "1615/40/8, Group 3, Thong Nhat Ward"
  },
  "orientations": [
    "N/A"
  ]
}