{"education": [{"institution_name": "Hanoi University of Science", "degree": "Degree in Computer and information science", "major": "Computer and information science", "gpa": "N/A", "start_time": "2012", "end_time": "2016"}], "work_experience": [{"company_name": "SETA INTERNATIONAL", "position": "Full stack developer", "working_industry": "N/A", "start_time": "05/2022", "end_time": "Now"}, {"company_name": "VB BANK", "position": "Full stack developer", "working_industry": "N/A", "start_time": "04/2021", "end_time": "04/2022"}, {"company_name": "NEXTOP ASIA", "position": "Full stack developer", "working_industry": "N/A", "start_time": "01/2019", "end_time": "04/2021"}, {"company_name": "CMC GLOBAL", "position": "Developer", "working_industry": "N/A", "start_time": "09/2017", "end_time": "07/2019"}, {"company_name": "FPT INFORMATION SYSTEM", "position": "Full stack developer", "working_industry": "N/A", "start_time": "06/2016", "end_time": "12/2017"}], "skills": {"spoken_language": ["N/A"], "programming_language": ["Java Core", "JSP", "Servlet", "Spring Boot", "Spring Framework", "React Native", "React", "Ember JS", "Angular", "Redux", "WebSocket"], "soft_skill": ["N/A"], "hard_skill": ["Redis", "ActiveMQ", "RabbitMQ", "MySQL", "Oracle", "MS SQL", "Jenkins", "SonarQube", "Open Shift", "Git", "Github", "Bitbucket", "Gitlab", "Writing technical document"]}, "achievements_and_honors": "N/A", "project": [{"project_name": "Aeris (Aerport)", "start_time": "05/2022", "end_time": "Now", "detailed_descriptions": ["This is a migration project converting technology from monolithic to microservices.", "This system uses different communication methods such as SOAP and REST. The system uses Hazelcast as a caching engine. All services are deployed on Google cloud platform.", "This is a telecommunications management system. The main functions are provisioning new devices, managing user information, services that users want to, collecting service fees, exporting reports.", "My task in the project is to do the migration of old technology and frontend screens to the new reactJs system while developing new api requirements."]}, {"project_name": "Ebank Util Refactoring", "start_time": "04/2021", "end_time": "04/2022", "detailed_descriptions": ["This is a back office system of VP Bank. The task of the system is to provide an interface for the back office block of vpbank to perform internal tasks such as batch transfer, reconciliation, annual fee payment for cards, sending email debt reminders…", "Previously, vpbank used an old ebank util system. This new system is a modified upgrade of the old system from .Net to Java and an upgrade from monolithic to microservices architecture.", "My current task is mainly performing functions related to money accounting and sending debt reminder emails. Perform accounting tasks from ebank util to ESB and T24 in many cases, from card to card, contract to card, account to account… From making direct calls to money transfer service or making transfers via file through FTP server.", "The system is designed according to microservices architecture, the services communicate directly with each other through RESTful protocol or DB link."]}, {"project_name": "Rakuten Binary Options", "start_time": "08/2019", "end_time": "04/2021", "detailed_descriptions": ["This system is a microservices system. Each of these services have a specific task including: calling to a third party, synchronizing data from redis to MySQL or calculating price or total money of an order. They communicate to each other by calling rest service or by pub-sub tool(ActiveMQ).", "The administrator page supports end users managing their account information, changing the configuration of the trading system. To control cash flow, order, report, payment of customers, change email template or config timing of the system (holiday, winter - summer time)", "The system also includes a trading page that allows end users to place or sell orders and the price chart. The customers choose a currency pair and place an order of this currency pair in a period of time. The price was received from a third party by websocket. When the term finishes, the system will judge that the order is win or lose."]}, {"project_name": "Rakuten Satoshi Securities", "start_time": "01/2019", "end_time": "08/2019", "detailed_descriptions": ["This system is a microservices system. Each service does a specific task like synchronizing data, calling third parties, exporting reports, sending email…", "All the data loaded into the caching system including memCached and Redis. There is a service that synchronizes data from memCached and Redis. The system has a low latency and all the data in memCached and Redis were backed up in some text files. So in case, there is an error the system doesn't lose data.", "Create back end new functions and user interface for these functions above specific for mobile web based on EmberJS.", "An administrator management website for bitcoin, ethereum and forex exchanges. Creating functions to manage wallets, withdraw and deposit money to buy and sell bitcoin. It also provides functions to manage, register new users."]}, {"project_name": "FIMS Mobile", "start_time": "12/2018", "end_time": "01/2019", "detailed_descriptions": ["This is a warehouse logistics management system for Korea's CJ group. Its main task is to provide a mobile web interface for the company's warehouse staff to perform management tasks and export reports on inventory, import and export goods.", "The warehouse information is provided by SAP, ABAP systems. This system calls the SAP core system to perform the tasks. The main business of the system includes many areas such as functional foods, cosmetics, and food."]}, {"project_name": "Distributed search engine", "start_time": "06/2017", "end_time": "12/2018", "detailed_descriptions": ["The system includes 3 nodes. They work following the master-slave mechanism. They share the work for each other. The data were loaded into three nodes. So if one of them has a problem the request will be processed by other nodes.", "Crawl database from 10 most popular newspapers in Vietnamese and create a search interface for users to search content of the crawled data.", "It has some other extended functions of searching like recommending topics, searching by topic, location…"]}, {"project_name": "Payment Gateway System", "start_time": "06/2017", "end_time": "12/2017", "detailed_descriptions": ["Create admin screen, and build html, css screen in user website based on the customer design.", "An application runs on mobile that stands between Mobifone and its partners. This is where Mobifone sends messages to their partners. These messages are about the payment of their customers. When the partners receive these messages, they will add or withdraw the money of Mobifone customers in the Mobifone partner account."]}, {"project_name": "Feedback Management System", "start_time": "09/2017", "end_time": "12/2017", "detailed_descriptions": ["A web site manages the feedback and complains about all of the services that were provided by Mobifone. This system allows users to enter complaints, process complaints, and export reports related to complaints. In addition, the system also allows managers to assess their employee process performance. This website can run on multi devices."]}, {"project_name": "Predicting age and sex of the Internet users", "start_time": "06/2016", "end_time": "09/2017", "detailed_descriptions": ["Crawl database and create user interface for the system", "The system is to predict age and sex of Internet users based on the articles that they have read. It uses some Natural Language Processing algorithms on about 8GB data of VnExpress users. The purpose of this project is to help VnExpress classify users and optimize advertisement."]}], "levels": "Developer", "certificates": {"language_certificates": {"certificate_language": "English", "certificate_name": "TOEIC", "certificate_point/level": "855"}, "other_certificates": {}}, "industry": "N/A", "objectives": "N/A", "personal_information": {"name": "Nguyen Gian Phuong", "current_job_position": "Full stack developer", "gender": "Male", "linkedin": "N/A", "website": "N/A", "facebook": "N/A", "instagram": "N/A", "earliest_university_year": "2012", "birthday": "1994"}, "contact_information": {"phone": "N/A", "email": "N/A", "country": "N/A", "city": "N/A", "address": "N/A"}}