{"job_title": ["Learning and development"], "industries": ["Manufacturing"], "orientation": ["N/A"], "gender": ["N/A"], "job_type": ["full_time"], "received_job_time": ["N/A"], "working_time": ["N/A"], "skills": ["N/A"], "descriptions": ["Designing, implementing, and managing the performance management process that aligns individual goals with business objectives and promotes regular feedback and development opportunities.", "Provide guidance and training to managers on effective performance management techniques and best practices.", "Analyze performance data identify trends and areas for improvement and make recommendations accordingly.", "Coordinate the performance management system, including developing and monitoring performance evaluations, performance development plans, and performance improvement plans.", "Organize and ensure the Performance Management Process is conducted effectively monthly, quarterly, yearly.", "Building and Revising the Learning Framework for per position the competencies framework and integrating competencies into various talent development processes, such as performance management and succession planning.", "Support employees in understanding and utilizing the learning framework for personal and professional development.", "Work with factory departments to ensure the learning progress of employees.", "Work with stakeholders and manager to identify and access future and current training needs, assess competency development needs, and develop a training roadmap to ensure they meet short- and long-term business objectives of Panasonic.", "Design and tailor training programs as necessary for all levels (Orientation, Soft Skills, Sales Skills Practical, Management, and Leadership…) focusing on Panasonic.", "Conduct and deliver training courses effectively with different methods and materials to encourage interaction and participation.", "Implementing new digital learning and new learning to ensure efficient and continuous innovation in learning and development.", "Develop a positive relationship with all employees. Promote direct communication and positive rapport amongst employees and managers, encouraging an environment for continual learning & development.", "Monitor and evaluate employee training progress and development by implementing an evaluation and proficiency assessment process that is consistent with company appraisal, developmental, and feedback standards.", "Manage and orient employees' growth and their learning & development journey through ongoing development that enables employee success. - Propose ideas for engagement activities related to learning and development to enhance values, culture, and performance.", "Be in charge of e-learning activities including analyzing training demands and implementing training plans & reports; Developing videos, exam systems, e-learning, examination software, technical tests for operators, etc.", "Analyze & design training curriculum including training content based on standard programs from International, business need, management skills…", "Other tasks as assigned."], "requirements": ["Education: University/College", "Language: Business English", "At least 5~7 years of experience in training at big-sized companies.", "Familiarity and ability to facilitate traditional and modern training methods (mentoring, coaching, on-the-job or in-classroom training, e-learning, workshops, simulations, etc.) with various stakeholders.", "Experience with Training Needs Analysis and writing training material.", "Track record in executing successful competency development programs.", "Ability to identify learning development needs and translate the needs into competency development plans for various functions and units.", "Proven experience in talent development, learning and development, or similar roles.", "Solid understanding of performance management processes and practices.", "Ability to plan, multi-task, and manage time effectively.", "Excellent communication, collaboration, and interpersonal skills", "Good leadership and influencing skills, ability to manage stakeholders.", "Ability to effectively deal with multiple priorities, functions, and activities.", "Strong Microsoft Office skills (PowerPoint, Word, Excel) and data skill", "Be able to use software to build E-learning lessons: Storyline, Ispring, Video scribe, Articulate 360…"], "benefits": ["100% of salary in probation time", "13th salary, performance bonus.", "24/24 insurance package, annual health check-up; allowance for petrol and attendance.", "Company trip, Year-end party.", "Many interesting domestic/overseas training courses from Panasonic Group"], "levels": ["N/A"], "roles": ["N/A"], "number_year_experience": ["N/A"], "number_candidate": ["N/A"], "education": [{"degree": ["University/College"], "major": ["N/A"], "gpa": ["N/A"]}], "certificates": {"language_certificates": [{"certificate_language": "English", "certificate_name": ["N/A"], "certificate_point_level": ["N/A"]}], "other_certificates": [{"certificate_name": ["N/A"], "certificate_point_level": ["N/A"]}]}, "salary": {"min_salary": ["N/A"], "max_salary": ["N/A"]}, "location": {"country": ["N/A"], "city/province": ["Binh Duong"], "address": ["No 1-3 Street 12, VSIP II-A, Vinh Tan Commune, Tan Uyen City"]}, "jd_file": "static/job/uploaded_jds/JD_-_Learning_development_Asst_Mgr.pdf"}