{"job_title": ["GIÁM ĐỐC KINH DOANH"], "industry": ["N/A"], "sex": ["N/A"], "job_type": ["N/A"], "received_job_time": ["N/A"], "working_time": ["N/A"], "skills": ["N/A"], "descriptions": ["Quản lý, điều hành toàn bộ hoạt động bán hàng của các dự án, đảm bảo đạt KPI bán hàng dự án theo chỉ đạo của Ban Tổng Giám đốc. Tìm kiếm các dự án mới, phối hợp với các đơn vị triển khai kế hoạch và chiến lược bán hàng các dự án bất động sản theo sát định hướng của Công ty."], "requirements": ["Tốt nghiệp Đại học trở lên chuyên ngành: Quản trị kinh doanh, Quản lý bất động sản, Kinh tế, Marketing, …\nTiếng Anh: giao tiếp tốt.\nThành thạo vi tính văn phòng, Internet, soạn thảo văn bản\nÍt nhất 03 năm kinh nghiệm ở các chức vụ Giám đốc Kinh doanh, Phó Tổng Giám đốc Kinh doanh ở các Công ty bất động sản.\nCó khả năng giao tiếp, đàm phán, thuyết phục.\nTrung thực, trách nhiệm.\nLãnh đạo, điều hành.\nKhả năng phân tích và tổng hợp thông tin, nhạy bén với các xu hướng của thị trường bất động sản.\nAm hiểu kiến thức pháp lý trong lĩnh vực kinh doanh bất động sản.\nChịu được áp lực cao trong công việc, sẵn sàng đi công tác xa theo yêu cầu công việc."], "benefits": ["Lương cạnh tranh theo năng lực;\nĐược tham gia đầy đủ các chế độ BHXH, BHYT, BHTN;\nChăm sóc sức khỏe, du lịch hàng năm;\nThưởng tháng 13 theo kết quả kinh doanh của Công ty.\nThưởng % hoa hồng trực tiếp theo quy định, chính sách chung của Công ty.\nThưởng cổ phiếu Esop hằng năm."], "levels": ["Manager"], "roles": ["GIÁM ĐỐC KINH DOANH"], "number_year_experience": ["N/A"], "number_candidate": ["N/A"], "education": {"degree": ["N/A"], "major": ["N/A"], "gpa": ["N/A"]}, "language_certificates": {"language_name": ["N/A"], "certificate_name": ["N/A"], "certificate_level": ["N/A"]}, "other_certificates": {"certificate_name": ["N/A"], "certificate_level": ["N/A"]}, "salary": {"min_salary": ["N/A"], "max_salary": ["N/A"]}, "location": {"country": ["N/A"], "city": ["TP.HCM"], "detail_address": ["N/A"]}}