{"job_title": ["Nhân viên kiểm soát chất lượng tiếng Nhật"], "industries": ["Software & IT Services"], "orientation": ["N/A"], "gender": ["N/A"], "job_type": ["N/A"], "received_job_time": ["N/A"], "working_time": ["5 days per week"], "skills": ["N/A"], "descriptions": ["Nghiên cứu thiết kế của trò chơi để viết test cases", "Kiểm tra và phát hiện, báo cáo các lỗi và những vấn đề gặp phải trong game trên điện thoại di động, trên các ứng dụng web hoặc công cụ.", "Cập nhật các dữ liệu về lỗi chính xác và đầy đủ.", "Phối hợp với các thành viên trong nhóm trong việc chia sẻ, thảo luận và tìm ra những vấn đề cần thiết nhằm triển khai dự án hiệu quả.", "Đóng góp ý kiến để hoàn thiện test cases, các mẫu hoặc công cụ.", "Dịch tài liệu từ tiếng Việt sang tiếng Nhật và ngược lại, làm phiên dịch khi được phân công.", "Thực hiện các công việc khác theo sự phân công của Trưởng nhóm và Trưởng Dự án."], "requirements": ["Tốt nghiệp đại học", "Thành thạo tiếng Nhật (trình độ đạt N2 trở lên)", "Năng động, sáng tạo và ham học hỏi", "Sẵn sàng làm việc áp lực cao", "Có thể làm việc theo nhóm hoặc độc lập"], "benefits": ["Thời gian làm việc: 5 ngày/tuần", "Địa điểm làm việc: Phòng 1403, tầng 14 tòa nhà Indochina Plaza Hà Nội, 241 Xuân Thủy, Cầu Giấy, Hà Nội", "Lương thưởng: Cạnh tranh", "Các chế độ khác: Đóng BH theo quy định của Nhà nước, trợ cấp ăn trưa, đánh giá hiệu quả làm việc và xét nâng lương 2 lần/năm, tham gia Bảo hiểm sức khỏe cao cấp, làm việc tại văn phòng hạng A với các thiết bị hiện đại, tham gia các câu lạc bộ thể dục thể thao...."], "levels": ["N/A"], "roles": ["QA Japanese"], "number_year_experience": ["N/A"], "number_candidate": ["N/A"], "education": [{"degree": ["University Degree"], "major": ["N/A"], "gpa": ["N/A"]}], "certificates": {"language_certificates": [{"certificate_language": ["Japanese"], "certificate_name": ["N/A"], "certificate_point_level": ["N2"]}], "other_certificates": [{"certificate_name": ["N/A"], "certificate_point_level": ["N/A"]}]}, "salary": {"min_salary": ["N/A"], "max_salary": ["N/A"]}, "location": {"country": ["Vietnam"], "city/province": ["Hanoi"], "address": ["#1403, Indochina Plaza Hanoi, 241 Xuan Thuy, Cau Giay"]}}